#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

// 数组的定义和内存存储结构
int main(void) {

	// 一维数组
	int arr1[10];	// 定义一个10元素的数组arr1;
	int arr2[8] = { 0 };	//定义一个8个元素的数组arr2并初始化,每个元素为0;
	int arr3[] = { 1,2,3,4,5,6 };	// 定义一个不指定元素个数数组arr3但必须初始化, 智能根据初始化来计算元素个数;

	// 二维数组
	int arr4[2][3];	// 定义一个2行3列的二维数组arr4;
	int arr5[3][4] = { {1,2,3,4},{3,4,5,6},{5,6,7,8} };	//  定义一个3行4列的二维数组arr5,并进行初始化;
	// int arr6[3][];	// 错误:没有指定列(必须指定列的个数);
	int arr7[][3] = { 1,2,3,4,5,6,7 };	// {{1,2,3},{4,5,6},{7,0,0}}

	// 数组的内存存储结构(使用地址)
	int i = 0;
	for (i = 0; i < 8; i++) {
		printf("%p\n", &arr1[i]);
			/*  
			00EFFA80
		    00EFFA84
			00EFFA88
			00EFFA8C
			00EFFA90
			00EFFA94
			00EFFA98
			00EFFA9C
			显示8个连续的空间地址
			*/
	}
	
	printf("-----------分----割----线-------------\n");
	int j = 0;

	for (i = 0; i < 3; i++) {
		for (j = 0; j < 4; j++) {
			printf("%p\t", &arr5[i][j]);
		}
		printf("\n");

			//0115F72C        0115F730        0115F734        0115F738
			//0115F73C        0115F740        0115F744        0115F748
			//0115F74C        0115F750        0115F754        0115F758

		// 理解这个非常重要:
		// 显示也是连续的内存地址, 所以二维数组可以理解为数组的数组(一个一维数组,它的每个元素也是一个一维数组)
		// 以arr5为例: 第一个元素名arr5[0], 第二个元素名arr5[1], 第三个元素名arr5[2]
		// 第一个arr5[0]的元素分别是:arr5[0][0],arr5[0][1],arr5[0][2],arr5[0][3]
		// 第二个arr5[1]的元素分别是:arr5[1][0],arr5[1][1],arr5[1][2],arr5[1][3]
		// 第三个arr5[2]的元素分别是:arr5[2][0],arr5[2][1],arr5[2][2],arr5[2][3]
	}

	return 0;
}