#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

int main(void) {

	// 隐式类型转换
	// 涉及一个概念:整型提升

	// char a 的内存存储形式: int 类型 00000000 00000000 00000000 00000101
	//                        截取够存储到char类型中              00000101
	char a = 5;		// a 是char类型, 赋值一个字面量5是一个int类型

	// char b 的内存存储形式: int 类型 00000000 00000000 00000000 01111110
	//                        截取够存储到char类型中              01111110
	char b = 126;	// b 是char类型, 赋值一个字面量126是一个int类型

	// a + b的时候有统一类型提升转换为整型再相加,规则为高位全部用变量的符号位补足(正数全补0, 负数全补1)
	// 00000101 ----> 00000000 00000000 00000000 00000101
	// 01111110 ----> 00000000 00000000 00000000 01111110
	// --------------------------------------------相加---
	//                00000000 00000000 00000000 10000011
	char c = a + b;	// c 是char类型, 所以相加结果00000000 00000000 00000000 10000011截取存放到char类型中的结果为10000011


	// 结果为 -125 ?
	//char c的结果为10000011(高位为1,是负数)
	printf("%d\n", c);	// 打印是以%d整型的方式打印
	// 10000011 类型提升为 11111111 11111111 11111111 10000011(补码)
	//                   11111111 11111111 11111111 10000010(反码)
	//					 10000000 00000000 00000000 01111101(原码)
	//-------------------------打印输出结果-----------   -125
	return 0;
}